In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("C:\\Users\\lokesh.s\\Documents\\Household energy bill data origanl.csv")
df

,num_rooms,num_people,housearea,is_ac,is_tv,is_flat,ave_monthly_income,num_children,is_urban,amount_paid
0,3,3,742.57,1,1,1,9675.93,2,0,560.481447
1,1,5,952.99,0,1,0,35064.79,1,1,633.283679
2,3,1,761.44,1,1,1,22292.44,0,0,511.879157
3,0,5,861.32,1,1,0,12139.08,0,0,332.992035
4,1,8,731.61,0,1,0,17230.10,2,1,658.285625
...,...,...,...,...,...,...,...,...,...,...
995,3,0,991.31,0,1,0,12687.26,1,1,655.870111
996,2,5,847.97,0,1,0,39502.92,0,0,354.472693
997,2,4,660.94,1,0,0,10145.17,0,1,568.660550
998,1,1,814.75,0,1,1,15535.05,0,1,653.423314
999,1,6,835.43,0,0,0,22204.00,0,1,537.801005

In [4]:
df[(df["ave_monthly_income"]=='-')]

Empty DataFrame
Columns: [num_rooms, num_people, housearea, is_ac, is_tv, is_flat, ave_monthly_income, num_children, is_urban, amount_paid]
Index: []

In [5]:
df=df.replace(-1,0)

In [6]:
df['ave_monthly_income']=df['ave_monthly_income'].apply(lambda x:0 if x<0 else x)

In [9]:
df['ave_monthly_income'][390:393]

390        0.00
391    13481.07
392     5200.62
Name: ave_monthly_income, dtype: float64

In [12]:
df['ave_monthly_income'].value_counts()

ave_monthly_income
0.00        6
9675.93     1
35064.79    1
22292.44    1
12139.08    1
           ..
12687.26    1
39502.92    1
10145.17    1
15535.05    1
22204.00    1
Name: count, Length: 995, dtype: int64

In [4]:
df.to_excel('lokesh household.xlsx',index=False)